/*
 * @Author: 杨宏旋
 * @Date: 2021-05-12 14:24:52
 * @LastEditors: 杨宏旋
 * @LastEditTime: 2021-05-12 14:26:12
 * @Description:
 */
/**
 * 请求状态码文案替换
 * @param {*} data 请求状态码
 */
export const RequestErrorTxt = function (data: number) {
  return {
    400: '操作异常，请联系管理员。联系电话：15270858924（微信同号）400',
    403: '操作异常，请联系管理员。联系电话：15270858924（微信同号）403',
    404: '请求错误,未找到该资源 404',
    405: '操作异常，请联系管理员。联系电话：15270858924（微信同号）405',
    408: '操作异常，请联系管理员。联系电话：15270858924（微信同号）408',
    500: '操作异常，请联系管理员。联系电话：15270858924（微信同号）500',
    501: '操作异常，请联系管理员。联系电话：15270858924（微信同号）501',
    502: '系统正在更新，请稍后重试 502',
    503: '系统正在更新，请稍后重试 503',
    504: '操作异常，请联系管理员。联系电话：15270858924（微信同号）504',
    505: '操作异常，请联系管理员。联系电话：15270858924（微信同号）505',
  }[data || 404]
}
